Tekla.Structures.Model.Plane
The Plane class defines a plane in space using an origin, an X-axis and a Y-axis.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Plane Plane = new Plane();
Plane.Origin = new Point(500, 0, 0);
Plane.AxisX = new Vector(500, 1000, 0);
Plane.AxisY = new Vector(500, 0, -1000);
}
}

Tekla.Structures.Model.Plane.Origin
The origin of the plane.

Tekla.Structures.Model.Plane.AxisX
The X-axis of the plane.

Tekla.Structures.Model.Plane.AxisY
The Y-axis of the plane.

Tekla.Structures.Model.Plane.#ctor
Initializes a new plane instance.

Tekla.Structures.Model.Plane.ToStruct(Tekla.Structures.ModelInternal.dotPlane_t@)


Tekla.Structures.Model.Plane.FromStruct(Tekla.Structures.ModelInternal.dotPlane_t@)
